import pandas as pd
from model_nomalizer import normalize_model

datagov_make_dict = {"אאודי": "אאודי",
                     "אופל": "אופל",
                     "איווייס": "אייוייז",
                     "איווקו": "איווקו",
                     "איסוזו": "איסוזו",
                     "אלפא רומיאו": "אלפא רומיאו",
                     "אסטון מרטין": "אסטון מרטין",
                     "במוו": "ב.מ.וו",
                     "ב מ וו": "ב.מ.וו",
                     "ביואיק": "ביואיק",
                     "בנטלי": "בנטלי",
                     "ג'יפ": "ג'יפ",
                     "גופל": "גופל",
                     "גילי": "ג'ילי",
                     "גרייטוול": "גרייטוול",
                     "דאציה": "דאצ'יה",
                     "דודג'": "דודג",
                     "די.אס": "DS",
                     "דייהטסו": "דייהטסו",
                     "האמר": "האמר",
                     "הונדה": "הונדה",
                     "וולוו": "וולוו",
                     "טויוטה": "טויוטה",
                     "טסלה": "טסלה",
                     "יגואר": "יגואר",
                     "יונדאי": "יונדאי",
                     "לינקולן": "פורד",
                     "לנדרובר": "לנדרובר",
                     "לנצ'יה": "לנצ'יה",
                     "לקסוס": "טויוטה",
                     "מ א ן": "מאן",
                     "מאן": "מאן",
                     "מ.ג": "סאיק-MG",
                     "מזארטי": "מזארטי",
                     "מזדה": "מאזדה",
                     "מיצובישי": "מיצובישי",
                     "מקסוס": "מקסוס",
                     "מרצדס": "מרצדס",
                     "ניסאן": "ניסאן",
                     "סאאב": "סאאב",
                     "סאנגיונג": "סאנגיונג",
                     "סובארו": "סובארו",
                     "סוזוקי": "סוזוקי",
                     "סיאט": "סיאט",
                     "סיטרואן": "סיטרואן",
                     "סמארט": "סמארט",
                     "סקודה": "סקודה",
                     "סקיוול": "סקיוול",
                     "סרס": "סרס",
                     "פולקסווגן": "פולקסווגן",
                     "פורד": "פורד",
                     "פורשה": "פורשה",
                     "פיאט": "פיאט",
                     "פיג'ו": "פיג'ו",
                     "פרארי": "פרארי",
                     "קאדילאק": "קדילאק",
                     "קיה": "קיה",
                     "קרייזלר": "קרייזלר",
                     "רובר": "לנדרובר",
                     "רנו": "רנו",
                     "שברולט": "שברולט", }

datagov_df = pd.read_csv('datagov_reduced.csv', encoding='windows-1255', engine='python')

dgamim = datagov_df['kinuy_mishari']
tozarim = datagov_df['tozar']
n_model_list = []




for i in range(dgamim.size):
    make = datagov_make_dict.get(tozarim[i])
    adjusted_model = dgamim.loc[i].upper()
    n_model = normalize_model(make, adjusted_model)
    n_model_list.append(n_model)


datagov_df['n_model'] = n_model_list

datagov_df.to_csv('datagov_n.csv', encoding='utf-8')




b=5