import csv
from urllib.request import urlopen

import pandas as pd
from bs4 import BeautifulSoup

from icar_extract import get_make_model_trim

makes = ["DS", "GAC", "SERES", "אבארט", "אודי", "אופל", "איווייז", "איווקו", "אינפיניטי", "איסוזו", "אלפא_רומיאו", "אסטון מרטין", "ב.מ.וו", "ביואיק", "בנטלי", "ג'ילי", "גיפ", "ג'נסיס", "גרייט וול", "דאציה", "דודג", "דייהטסו", "האמר", "הונדה", "וולוו", "טויוטה", "טסלה", "יגואר", "יונדאי", "לינקולן", "לנדרובר", "לנציה", "לקסוס", "מאזדה", "מאן", "מזראטי", "מיני", "מיצובישי", "מקסוס", "מרצדס", "ניסאן", "סאאב", "סאיק-MG", "סאנגיונג", "סובארו", "סוזוקי", "סיאט", "סיטרואן", "סמארט", "סקודה", "סקייוול", "פולקסווגן", "פונטיאק", "פורד", "פורשה", "פיאט", "פיג'ו", "פרארי", "קדילאק", "קופרה", "קיה", "קרייזלר", "ראם", "רנו", "שברולט"]
makefile_dict = {"אודי": "אאודי",
                  "אינפיניטי": "ניסאן",
                  "אלפא_רומיאו": "אלפא_רומיאו",
                  "אסטון_מרטין": "אסטון מרטין",
                  "ב מ וו": "ב.מ.וו",
                  "גילי": "ג'ילי",
                  "ג'נסיס": "יונדאי",
                  "גיפ": "ג'יפ",
                  "דאציה": "דאצ'יה",
                  "דודג'": "קרייזלר",
                  "דודג": "קרייזלר",
                  "וולבו": "וולוו",
                  "די אס": "DS",
                  "די.אס": "DS",
                  "יונדאי": "יונדאי",
                  "לינקולן": "פורד",
                  "לנציה": "לנצ'יה",
                  "לקסוס": "טויוטה",
                  "מזדה": "מאזדה",
                  "מ א ן": "מאן",
                  "מיני": "ב.מ.וו",
                  "מ.ג": "סאיק-MG",
                  "קופרה": "סיאט",
                  "פיגו": "פיג'ו",
                  "קאדילאק": "קדילאק",
                  "ראם": "קרייזלר",
                  }
makefile_makes = ["DS", "אלפא רומיאו", "אופל", "איווקו", "אייוייז", "איסוזו", "אסטון מרטין", "ב.מ.וו",
 "ביואיק", "בנטלי",
         "ג'ילי", "ג'יפ", "גרייט וול", "דאצ'יה", "דייהטסו", "האמר", "הונדה", "וולוו", "טויוטה", "טסלה", "יגואר",
         "יונדאי", "לנדרובר", "לנצ'יה", "מאזדה", "מאן", "מזראטי", "מיצובישי", "מקסוס", "מרצדס", "ניסאן", "סאאב",
         "סאיק-MG", "סאנגיונג", "סובארו", "סוזוקי", "סיאט", "סיטרואן", "סמארט", "סקודה", "סקייוול", "פולסטאר", "פורד",
         "פורשה", "פיאט", "פיג'ו", "פרארי", "קדילאק", "קיה", "קרייזלר", "רנו", "שברולט"]

datagov_make_dict = {"אאודי": "אאודי",
                     "אופל": "אופל",
                     "איווייס": "אייוייז",
                     "איווקו": "איווקו",
                     "איסוזו": "איסוזו",
                     "אלפא רומיאו": "אלפא רומיאו",
                     "אסטון מרטין": "אסטון מרטין",
                     "במוו": "ב.מ.וו",
                     "ביואיק": "ביואיק",
                     "בנטלי": "בנטלי",
                     "ג'יפ": "ג'יפ",
                     "גופל": "גופל",
                     "גילי": "ג'ילי",
                     "גרייטוול": "גרייטוול",
                     "דאציה": "דאצ'יה",
                     "דודג'": "דודג'",
                     "די.אס": "DS",
                     "דייהטסו": "דייהטסו",
                     "האמר": "האמר",
                     "הונדה": "הונדה",
                     "וולבו": "וולבו",
                     "טויוטה": "טויוטה",
                     "טסלה": "טסלה",
                     "יגואר": "יגואר",
                     "יונדאי": "יונדאי",
                     "לינקולן": "לינקולן",
                     "לנדרובר": "לנדרובר",
                     "לנצ'יה": "לנצ'יה",
                     "לקסוס": "טויוטה",
                     "מ א ן": "מאן",
                     "מ.ג": "סאיק-MG",
                     "מזארטי": "מזארטי",
                     "מזדה": "מאזדה",
                     "מיצובישי": "מיצובישי",
                     "מקסוס": "מקסוס",
                     "מרצדס": "מרצדס",
                     "ניסאן": "ניסאן",
                     "סאאב": "סאאב",
                     "סאנגיונג": "סאנגיונג",
                     "סובארו": "סובארו",
                     "סוזוקי": "סוזוקי",
                     "סיאט": "סיאט",
                     "סיטרואן": "סיטרואן",
                     "סמארט": "סמארט",
                     "סקודה": "סקודה",
                     "סקיוול": "סקיוול",
                     "סרס": "סרס",
                     "פולקסווגן": "פולקסווגן",
                     "פורד": "פורד",
                     "פורשה": "פורשה",
                     "פיאט": "פיאט",
                     "פיג'ו": "פיג'ו",
                     "פרארי": "פרארי",
                     "קאדילאק": "קדילאק",
                     "קיה": "קיה",
                     "קרייזלר": "קרייזלר",
                     "רובר": "רובר",
                     "רנו": "רנו",
                     "שברולט": "שברולט", }
icar_make_dict = {"DS": "DS",
                  "SERES": "סרס",
                  "אבארט": "פיאט",
                  "אודי": "אאודי",
                  "אופל": "אופל",
                  "איווייז": "אייוייז",
                  "איווקו": "איווקו",
                  "אינפיניטי": "ניסאן",
                  "איסוזו": "איסוזו",
                  "אלפא רומיאו": "אלפא רומיאו",
                  "אסטון מרטין": "אסטון מרטין",
                  "ב.מ.וו": "ב.מ.וו",
                  "ביואיק": "ביואיק",
                  "בנטלי": "בנטלי",
                  "ג'ילי": "ג'ילי",
                  "גיפ": "גיפ",
                  "ג'נסיס": "יונדאי",
                  "גרייטוול": "גרייטוול",
                  "דאציה": "דאצ'יה",
                  "דודג": "דודג'",
                  "דייהטסו": "דייהטסו",
                  "האמר": "האמר",
                  "הונדה": "הונדה",
                  "וולוו": "וולוו",
                  "טויוטה": "טויוטה",
                  "טסלה": "טסלה",
                  "יגואר": "יגואר",
                  "יונדאי": "יונדאי",
                  "לינקולן": "לינקולן",
                  "לנדרובר": "לנדרובר",
                  "לנציה": "לנצ'יה",
                  "לקסוס": "טויוטה",
                  "מאזדה": "מאזדה",
                  "מאן": "מאן",
                  "מזראטי": "מזראטי",
                  "מיני": "ב.מ.וו",
                  "מיצובישי": "מיצובישי",
                  "מקסוס": "מקסוס",
                  "מרצדס": "מרצדס",
                  "ניסאן": "ניסאן",
                  "סאאב": "סאאב",
                  "סאיק-MG": "סאיק-MG",
                  "סאנגיונג": "סאנגיונג",
                  "סובארו": "סובארו",
                  "סוזוקי": "סוזוקי",
                  "סיאט": "סיאט",
                  "סיטרואן": "סיטרואן",
                  "סמארט": "סמארט",
                  "סקודה": "סקודה",
                  "סקייוול": "סקייוול",
                  "פולקסווגן": "פולקסווגן",
                  "פונטיאק": "פונטיאק",
                  "פורד": "פורד",
                  "פורשה": "פורשה",
                  "פיאט": "פיאט",
                  "פיג'ו": "פיג'ו",
                  "פרארי": "פרארי",
                  "קדילאק": "קדילאק",
                  "קופרה": "סיאט",
                  "קיה": "קיה",
                  "קרייזלר": "קרייזלר",
                  "ראם": "דודג'",
                  "רנו": "רנו",
                  "שברולט": "שברולט"}



make_df = pd.DataFrame()
make_files = [f"{x}.txt" for x in makes]
model_dict = dict()
csvfile = open('icar_models.csv', 'w', encoding='utf-8', newline='')
csvwriter = csv.writer(csvfile)
for make in makes:
	with open(f"{make}.txt", 'r', encoding='utf-8') as reader:
		urls = reader.readlines()
		models = []
	for url in urls:
		try:
			page = urlopen(url)
		except:
			continue
		soup = BeautifulSoup(page, 'lxml')
		details = get_make_model_trim(soup)
		models.append(details[1])
	model_set = set(models)
	models = list(model_set)
	out_list = [make]
	out_list.extend(models)
	csvwriter.writerow(out_list)


	b=5




#make_df = pd.DataFrame.from_dict(model_dict)
#make_df.to_csv('models.csv', encoding='utf-8')
b=5








# icar_url = "https://www.icar.co.il/ג'יפ/ג'יפ_רנגלר/ג'יפ_רנגלר_חדש/version24585/"
# icar_url = 'https://www.icar.co.il/אודי/אודי_A1/אודי_A1_יד_שניה_ד10/version7800/'
# cursor = icar_version_extract(icar_url)

b = 5
