from urllib.request import urlopen
from urllib.parse import quote



makes = ["DS", "GAC", "SERES", "אבארט", "אודי", "אופל", "איווייז", "איווקו", "אינפיניטי", "איסוזו", "אלפא רומיאו", "אסטון מרטין", "בוו", "ביואיק", "בנטלי", "ג'ילי", "גיפ", "ג'נסיס", "גרייט וול", "דאציה", "דודג", "דייהטסו", "האמר", "הונדה", "וולוו", "טויוטה", "טסלה", "יגואר", "יונדאי", "לינקולן", "לנדרובר", "לנציה", "לקסוס", "מאזדה", "מאן", "מזראטי", "מיני", "מיצובישי", "מקסוס", "מרצדס", "ניסאן", "סאאב", "סאיק-MG", "סאנגיונג", "סובארו", "סוזוקי", "סיאט", "סיטרואן", "סמארט", "סקודה", "סקייוול", "פולקסווגן", "פונטיאק", "פורד", "פורשה", "פיאט", "פיגו", "פרארי", "קדילאק", "קופרה", "קיה", "קרייזלר", "ראם", "רנו", "שברולט"]
makes_quotes = [quote(i) for i in makes]
icar = 'https://www.icar.co.il/'

if 'DS' in makes:
    a = 54

urls = [(icar + i) for i in makes_quotes]

page = urlopen(urls[0]).read().decode('utf-8')

b=5